# Film Business Data Analysis with MySQL

Welcome to my data analysis notebook showcasing my MySQL skills in analyzing a film business database. In this notebook, I demonstrate various SQL queries to extract insightful information from the database, simulating scenarios that a business owner might encounter in the film industry.

The database includes tables for actors, customers, films, inventory, sales, stores, and more, akin to a film rental business like Blockbuster. Each query is designed to provide meaningful insights into different aspects of the business, such as sales performance, customer behavior, film popularity, and inventory management.

By exploring this notebook, you'll gain an understanding of my proficiency in SQL querying and my ability to derive actionable insights from data. Whether it's identifying top-selling films, analyzing customer rental patterns, or assessing store performance, I showcase my skills in extracting, transforming, and analyzing data to inform business decision-making.

Feel free to explore the queries and analyses presented here. If you have any questions or would like to discuss my approach further, please don't hesitate to reach out. Thank you for considering my work, and I hope you find this demonstration informative and insightful.

(*NOTE: Most prompts have limit of 5 to save space in the notebook, but in practice this should be without LIMIT*)

# Easy-level

## 1. Get the total number of films in inventory.

I'll get only the number of films without counting the copies

In [15]:
%%sql

SELECT
    MAX(film_id) AS '# of films'
FROM
    inventory;

 * mysql+mysqlconnector://root:***@localhost/sakila
1 rows affected.

[(1000,)]

## 2. Find out the most popular genre among customers.

The most popular is not necessarily the one with most sales (in $) but the one with most amount of rentals.

Here we have no direct connection between rentals and categories, we need to join the rental, inventory and film_list tables. This way we can add the category for each row. With this we can get the number of rentals per category, or directly compute the maximum category and number of rentals.

First we will get the number of rentals per category:

In [16]:
%%sql

SELECT
    category,
    COUNT(rental_id)
FROM
    rental
JOIN
    inventory
    ON
        rental.inventory_id = inventory.inventory_id
JOIN 
    film_list
    ON
        inventory.film_id = film_list.FID
GROUP BY
    category
LIMIT 5;

 * mysql+mysqlconnector://root:***@localhost/sakila
5 rows affected.

[('Documentary', 1050),
 ('Horror', 846),
 ('Family', 1096),
 ('Foreign', 1033),
 ('Comedy', 941)]

Here we get directly the category with most rentals:

In [17]:
%%sql

SELECT
    category,
    COUNT(rental_id) AS num_rents
FROM
    rental
JOIN
    inventory
    ON
        rental.inventory_id = inventory.inventory_id
JOIN 
    film_list
    ON
        inventory.film_id = film_list.FID
GROUP BY
    category
ORDER BY 
    num_rents   DESC
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sakila
1 rows affected.

[('Sports', 1167)]

## 3. Get a list of customers who have rented more than 20 films.

In [18]:
%%sql
SELECT
    customer_id,
    COUNT(rental_id) AS rents_per_customer
FROM
    rental
GROUP BY
    customer_id
HAVING
    rents_per_customer > 20
ORDER BY 
    rents_per_customer #This is added to ensure customers rented more than 20 films
LIMIT
    5;

 * mysql+mysqlconnector://root:***@localhost/sakila
5 rows affected.

[(17, 21), (33, 21), (88, 21), (94, 21), (118, 21)]

# Intermediate-level

## 4. List the top 10 best-selling films by revenue.

Here we display the $ generated by each film. We need to join again rental, inventory and film list to consider the price of each movie

In [19]:
%%sql

SELECT 
    title,
    SUM(price) AS revenue_per_title
FROM
    rental
JOIN
    inventory
    ON 
        inventory.inventory_id = rental.inventory_id
JOIN
    film_list
    ON
        film_list.FID = inventory.film_id
GROUP BY 
    title
ORDER BY 
    revenue_per_title DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost/sakila
10 rows affected.

[('BUCKET BROTHERHOOD', Decimal('169.66')),
 ('SCALAWAG DUCK', Decimal('159.68')),
 ('WIFE TURN', Decimal('154.69')),
 ('GOODFELLAS SALUTE', Decimal('154.69')),
 ('ZORRO ARK', Decimal('154.69')),
 ('APACHE DIVINE', Decimal('154.69')),
 ('WITCHES PANIC', Decimal('149.70')),
 ('MASSACRE USUAL', Decimal('149.70')),
 ('CAT CONEHEADS', Decimal('149.70')),
 ('HARRY IDAHO', Decimal('149.70'))]

## 5. Get the average rental duration of films in days.

This can be directly calculated by using 'TIMESTAMPDIFF'

In [20]:
%%sql
SELECT
    AVG(TIMESTAMPDIFF(DAY, rental_date, return_date)) AS mean_rent_duration
FROM 
    rental;

 * mysql+mysqlconnector://root:***@localhost/sakila
1 rows affected.

[(Decimal('4.5259'),)]

## 6. List the films that have deleted scenes

The type of data in the special_features column of the film table is a set, we can use the builtin function FIND_IN_SET

In [21]:
%%sql

SELECT
    title,
    special_features
FROM
    film
WHERE 
    FIND_IN_SET('Deleted Scenes', special_features)
LIMIT 5;

 * mysql+mysqlconnector://root:***@localhost/sakila
5 rows affected.

[('ACADEMY DINOSAUR', {'Behind the Scenes', 'Deleted Scenes'}),
 ('ACE GOLDFINGER', {'Trailers', 'Deleted Scenes'}),
 ('ADAPTATION HOLES', {'Trailers', 'Deleted Scenes'}),
 ('AFRICAN EGG', {'Deleted Scenes'}),
 ('AGENT TRUMAN', {'Deleted Scenes'})]

## 7. Identify the customers who have rented films in more than 12 genres.

Here we can count different generes per customer, for that we need to merge the rental, inventory and film_list again

In [22]:
%%sql 

SELECT
    customer_id,
    COUNT(DISTINCT category) category_diversity
FROM
    rental
JOIN 
    inventory
    ON
        inventory.inventory_id = rental.inventory_id
JOIN
    film_list
    ON
        film_list.FID = inventory.film_id
GROUP BY
    customer_id
HAVING 
    category_diversity > 12
ORDER BY 
    category_diversity
LIMIT 5;

 * mysql+mysqlconnector://root:***@localhost/sakila
5 rows affected.

[(2, 13), (3, 13), (6, 13), (10, 13), (14, 13)]

# Advanced - level

## 8. Retrieve the customer who spent the most on rentals.

As usual we join rental, inventory and film_list tables but additionally we add the customer table to get the customer name as well.

In [23]:
%%sql
SELECT
    customer.customer_id,
    first_name,
    last_name,
    SUM(price) AS spent
FROM
    rental
JOIN 
    inventory
    ON
        inventory.inventory_id = rental.inventory_id
JOIN
    film_list
    ON  
        film_list.FID = inventory.film_id
JOIN
    customer
    ON
        customer.customer_id = rental.customer_id
GROUP BY
    customer.customer_id, first_name, last_name
ORDER BY
    spent DESC 
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sakila
1 rows affected.

[(148, 'ELEANOR', 'HUNT', Decimal('147.54'))]

## 9. Identify the actors who have starred in 30 or more films.

In this case we need to join the film_actor table with the actor table to get the name of the actors who have been in more than 30 films

In [24]:
%%sql 
SELECT
    actor.actor_id,
    COUNT(film_id) AS num_films
FROM    
    film_actor
JOIN
    actor
    ON
        actor.actor_id = film_actor.actor_id
GROUP BY
    actor_id
HAVING
    num_films >= 30
ORDER BY 
    num_films
LIMIT 5;

 * mysql+mysqlconnector://root:***@localhost/sakila
5 rows affected.

[(7, 30), (196, 30), (14, 30), (128, 30), (20, 30)]

## 10. Identify the customers who have rented the same film multiple times.

In [25]:
%%sql

SELECT 
    first_name,
    last_name,
    title,
    COUNT(rental_id) AS rent_repetition
FROM
    rental
JOIN
    inventory
    ON
        rental.inventory_id = inventory.inventory_id
JOIN
    customer
    ON
        customer.customer_id = rental.customer_id
JOIN
    film_list
    ON
        film_list.FID = inventory.film_id
GROUP BY
    first_name, last_name, title
HAVING
    rent_repetition >= 2
LIMIT
    5;

 * mysql+mysqlconnector://root:***@localhost/sakila
5 rows affected.

[('MARY', 'SMITH', 'PATIENT SISTER', 2),
 ('MARY', 'SMITH', 'FIREBALL PHILADELPHIA', 2),
 ('JENNIFER', 'DAVIS', 'ENGLISH BULWORTH', 2),
 ('JENNIFER', 'DAVIS', 'SLEUTH ORIENT', 2),
 ('MARIA', 'MILLER', 'TELEMARK HEARTBREAKERS', 2)]

## 11. List the films that have not been rented yet.

In [26]:
%%sql

SELECT
    FID,
    title
FROM
    film_list
WHERE
    FID NOT IN
    (
        SELECT
            inventory.film_id
        FROM
            rental
        JOIN
            inventory
            ON
                inventory.inventory_id = rental.inventory_id
    )
LIMIT
    5;

 * mysql+mysqlconnector://root:***@localhost/sakila
5 rows affected.

[(14, 'ALICE FANTASIA'),
 (33, 'APOLLO TEEN'),
 (36, 'ARGONAUTS TOWN'),
 (38, 'ARK RIDGEMONT'),
 (41, 'ARSENIC INDEPENDENCE')]